//Напишите программу, которая выводит третью
//цифру заданного числа или сообщает, что третьей цифры нет.
System.Console.WriteLine("Enter number: ");
string StrN = System.Console.ReadLine();
int number = Convert.ToInt32(StrN);