//Напишите программу, которая выводит третью
//цифру заданного числа или сообщает, что третьей цифры нет.
System.Console.WriteLine("Enter number: ");
string StrN = System.Console.ReadLine();
int number = Convert.ToInt32(StrN);
int Ndigits;
int count=0;
while (Math.Abs(number)/10>0,1|number==0)
   {
    Ndigits++;
    count++;
   }
System.Console.WriteLine("works");